Revit 2024 API
ViewSheet.GetAllRevisionCloudIds Method
 Gets the ids of the revision clouds which appear on the sheet's revision schedules.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2023.1
Syntax
C#
public ISet<ElementId> GetAllRevisionCloudIds()
Visual Basic
Public Function GetAllRevisionCloudIds As ISet(Of ElementId)
Visual C++
public:
ISet<ElementId^>^ GetAllRevisionCloudIds()
Return Value
 The ids of the revisions clouds which appear on the sheet's revision schedules.
Remarks
 The sheet's revision schedules include the revisions that are associated with revision clouds that are visible on the sheet. Revision schedules may also include revisions that have been additionally added to the sheet via the Revisions On Sheets parameter. Use GetAdditionalRevisionIds() to get the additionally added revisions.
See Also
ViewSheet Class
Autodesk.Revit.DB Namespace